<?php

/*
 * @wordpress-plugin
 * Plugin Name:       _ANDYP - CPT - Event
 * Plugin URI:        http://londonparkour.com
 * Description:       <strong>📬CPT</strong> | Adds CPT - Event
 * Version:           1.0.0
 * Author:            Andy Pearson
 * Author URI:        https://londonparkour.com
 * Domain Path:       /languages
 */


define( 'ANDYP_CPT_EVENT_PATH', __DIR__ );
define( 'ANDYP_CPT_EVENT_URL', plugins_url( '/', __FILE__ ) );
define( 'ANDYP_CPT_EVENT_PLUGIN_FILE',  __FILE__ );

//  ┌─────────────────────────────────────────────────────────────────────────┐
//  │                    Register with ANDYP Plugins                          │
//  └─────────────────────────────────────────────────────────────────────────┘
require __DIR__.'/src/acf/andyp_plugin_register.php';


// ┌─────────────────────────────────────────────────────────────────────────┐
// │                         Use composer autoloader                         │
// └─────────────────────────────────────────────────────────────────────────┘
require __DIR__.'/vendor/autoload.php';

// ┌─────────────────────────────────────────────────────────────────────────┐
// │                    Plugin Activation - once only.    		             │
// └─────────────────────────────────────────────────────────────────────────┘
new andyp\cpt\event\setup\activate;


// ┌─────────────────────────────────────────────────────────────────────────┐
// │                        	   Initialise    		                     │
// └─────────────────────────────────────────────────────────────────────────┘
(new andyp\cpt\event\initialise)->run();

